import { describe, test, expect } from 'vitest'

describe('LottoController > ', () => {
  test('8000원을 지불하면 로또 8개를 살 수 있다.')

  test('7500원을 지불하면 로또 7개를 살 수 있다.')

  test('로또를 1000원 미만으로 구매할 수 없다.')

  test('로또 당첨 번호를 자동으로 추가할 수 있다.')

  test('로또 당첨 번호를 수동으로 추가할 수 있다.')

  test('보너스 당첨 번호를 추가할 수 있다.')

  test('현재 당첨 번호들을 확인할 수 있다.')

  test('로또 당첨 규칙을 확인할 수 있다.')

  test('로또 당첨 규칙을 정할 수 있다.')

  test('로또 당첨 규칙을 정하지 않으면 기본 규칙이 적용된다.')

  test('로또 당첨 규칙을 개별로 정할 수 있다.: 0개 일치 시 1,000,000원')

  test('로또 당첨 통계를 확인할 수 있다.')

  test('총 수익률을 확인할 수 있다.')
})
